# HOME PRICE PREDICT

In [1]:
import numpy as np
import pandas as pd
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.preprocessing import LabelEncoder

In [2]:
data=pd.read_csv(r'C:\Users\MANJU\Desktop\Datasets\house_price_prediction_linear_reg_deployment\house_price.csv')

In [3]:
data.head()

   Unnamed: 0      Location  BHK  Furnishing  Sq.ft  Old(years)  Floor  Price
0          37  Bommanahalli    3           1   3000           1      3  28000
1          43  Bommanahalli    3           1   1650          10      0  18000
2          12    Whitefield    2           0   1000           5      3  16400
3           8    Whitefield    3           0   1600           1      9  27000
4           9    Whitefield    2           1   1200           5      1  20000

In [4]:
data=data.iloc[:,1:]

In [5]:
data.head()

       Location  BHK  Furnishing  Sq.ft  Old(years)  Floor  Price
0  Bommanahalli    3           1   3000           1      3  28000
1  Bommanahalli    3           1   1650          10      0  18000
2    Whitefield    2           0   1000           5      3  16400
3    Whitefield    3           0   1600           1      9  27000
4    Whitefield    2           1   1200           5      1  20000

In [6]:
enc=LabelEncoder()
Location=enc.fit_transform(data.iloc[:,0])

In [9]:
x=data.iloc[:,[0,1,2,3,4,5]]
x.head()

       Location  BHK  Furnishing  Sq.ft  Old(years)  Floor
0  Bommanahalli    3           1   3000           1      3
1  Bommanahalli    3           1   1650          10      0
2    Whitefield    2           0   1000           5      3
3    Whitefield    3           0   1600           1      9
4    Whitefield    2           1   1200           5      1

In [10]:
y=data.Price
y.head()

0    28000
1    18000
2    16400
3    27000
4    20000
Name: Price, dtype: int64

In [11]:
x=pd.get_dummies(x,drop_first=True)

In [12]:
x.head()

   BHK  Furnishing  Sq.ft  Old(years)  Floor  Location_Whitefield
0    3           1   3000           1      3                    0
1    3           1   1650          10      0                    0
2    2           0   1000           5      3                    1
3    3           0   1600           1      9                    1
4    2           1   1200           5      1                    1

In [13]:
x_train,x_test,y_train,y_test=train_test_split(x,y,test_size=0.3)

In [14]:
x_train.head()

     BHK  Furnishing  Sq.ft  Old(years)  Floor  Location_Whitefield
966    2           0   1280           5      3                    1
346    2           0   1290           1     10                    1
365    2           1   1089           5      2                    0
838    3           1   1250           1      1                    0
538    2           1   1300           5      3                    0

In [15]:
y_train.head()

966    23000
346    26000
365    15500
838    20000
538    20000
Name: Price, dtype: int64

In [16]:
y_test.head()

868    18000
701    39000
182    14000
964    14000
737    16000
Name: Price, dtype: int64

In [17]:
x_test.head()

     BHK  Furnishing  Sq.ft  Old(years)  Floor  Location_Whitefield
868    2           0   1050          10      2                    0
701    3           0   2292           5     12                    1
182    2           0    950           5      1                    0
964    2           0    950           5      1                    0
737    2           0   1135          10      2                    0

In [18]:
lr=LinearRegression()
lr.fit(x_train,y_train)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None,
         normalize=False)

In [19]:
predict=lr.predict(x_test)

In [20]:
r2_score(y_test,predict)

0.850390739005587